### Required Packages

#### Table of Contents

    1.0 Loading the Dataset
    
    1.1 Working without Duplicates
        1.1.1 Selecting Distinct Observations by removing duplicates.
        1.1.2 Counting distinct records.
        1.1.3 Selecting Top 10.
        1.1.4 Selecting with multiple conditions.
        1.1.5 Selecting only the required columns.
        
    1.2 Using Where Statement as a Filter
        1.2.1 Where statement
        1.2.3 Having as an extra filter
    
    1.3 Tables Joinings and Merging
        1.3.1 Inner Join
        1.3.2 Left Join
        1.3.3 Right Join
        1.3.4 Self Join
        1.3.5 Union
        1.3.6 Union All
    
    1.4 Creating new features using Case Statement 
    
    1.5 Sort Records
        1.5.1 Sorting Records in Ascending order
        1.5.2 Sorting Records in 
        
    1.6 Matching Certain String
        1.6.1 Containing
        1.6.2 Like
        1.6.3 Startwith
        1.6.4 Endwith
        
    1.7 Converting a table from Flat to Wide uisng Case statement.
    
    1.8 Using Group by statement
    
    1.9 Window Functions

### 1.0 Loading the Datasets

In [1]:
import pandas as pd
import numpy as np
from pandasql import sqldf
import json
import os
from sklearn.datasets import fetch_california_housing
pd.options.display.float_format = '{:.2f}'.format

In [20]:
# Create a function to glimpse the data
def glimpse(df):
    display(df.info())
    display(df.head())
    display(df.describe())
    #print(f"{df.shape[0]} rows and {df.shape[1]} columns")

def check_missing_data(df):
    missing_columns = df.columns[df.isnull().any()].tolist()
    if len(missing_columns) > 0:
        print("Columns with missing data:")
        for col in missing_columns:
            missing_rows = df[col].isnull().sum()
            print(f"{col}: {missing_rows} missing rows")
    else:
        print("No columns have missing data.")

#### Datasets for Use

In [21]:
# Load data (will download the data if it's the first time loading)
housing = fetch_california_housing(as_frame=True)
# Create a dataframe
df_0 = housing['data'].join(housing['target'])
glimpse(df_0)
check_missing_data(df_0)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MedInc       20640 non-null  float64
 1   HouseAge     20640 non-null  float64
 2   AveRooms     20640 non-null  float64
 3   AveBedrms    20640 non-null  float64
 4   Population   20640 non-null  float64
 5   AveOccup     20640 non-null  float64
 6   Latitude     20640 non-null  float64
 7   Longitude    20640 non-null  float64
 8   MedHouseVal  20640 non-null  float64
dtypes: float64(9)
memory usage: 1.4 MB

None

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.33,41.00,6.98,1.02,322.00,2.56,37.88,-122.23,4.53
1,8.30,21.00,6.24,0.97,2401.00,2.11,37.86,-122.22,3.58
2,7.26,52.00,8.29,1.07,496.00,2.80,37.85,-122.24,3.52
3,5.64,52.00,5.82,1.07,558.00,2.55,37.85,-122.25,3.41
4,3.85,52.00,6.28,1.08,565.00,2.18,37.85,-122.25,3.42

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
count,20640.00,20640.00,20640.00,20640.00,20640.00,20640.00,20640.00,20640.00,20640.00
mean,3.87,28.64,5.43,1.10,1425.48,3.07,35.63,-119.57,2.07
std,1.90,12.59,2.47,0.47,1132.46,10.39,2.14,2.00,1.15
min,0.50,1.00,0.85,0.33,3.00,0.69,32.54,-124.35,0.15
25%,2.56,18.00,4.44,1.01,787.00,2.43,33.93,-121.80,1.20
50%,3.53,29.00,5.23,1.05,1166.00,2.82,34.26,-118.49,1.80
75%,4.74,37.00,6.05,1.10,1725.00,3.28,37.71,-118.01,2.65
max,15.00,52.00,141.91,34.07,35682.00,1243.33,41.95,-114.31,5.00

No columns have missing data.

In [22]:
df_1 = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
# dropping null value columns to avoid errors
df_1.dropna(inplace = False)
glimpse(df_1)
check_missing_data(df_1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

None

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,Texas,7730337.00
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,Marquette,6796117.00
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,Georgia State,1148640.00
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,NaN,5000000.00

       Number    Age  Weight      Salary
count  457.00 457.00  457.00      446.00
mean    17.68  26.94  221.52  4842684.11
std     15.97   4.40   26.37  5229237.60
min      0.00  19.00  161.00    30888.00
25%      5.00  24.00  200.00  1044792.25
50%     13.00  26.00  220.00  2839073.00
75%     25.00  30.00  240.00  6500000.00
max     99.00  40.00  307.00 25000000.00

Columns with missing data:
Name: 1 missing rows
Team: 1 missing rows
Number: 1 missing rows
Position: 1 missing rows
Age: 1 missing rows
Height: 1 missing rows
Weight: 1 missing rows
College: 85 missing rows
Salary: 12 missing rows

In [23]:
url = 'http://universities.hipolabs.com/search?'
# Load the first sheet of the JSON file into a data frame
df_2 = pd.read_json(url, orient='columns').applymap(str)
df_2 = df_2.applymap(str)
glimpse(df_2)
check_missing_data(df_2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9934 entries, 0 to 9933
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   web_pages       9934 non-null   object
 1   domains         9934 non-null   object
 2   country         9934 non-null   object
 3   name            9934 non-null   object
 4   state-province  9934 non-null   object
 5   alpha_two_code  9934 non-null   object
dtypes: object(6)
memory usage: 465.8+ KB

None

,web_pages,domains,country,name,state-province,alpha_two_code
0,['https://karazin.ua'],"['student.karazin.ua', 'karazin.ua']",Ukraine,Kharkiv National University,None,UA
1,['https://usm.cl'],['usm.cl'],Chile,Universidad Técnica Federico Santa María,None,CL
2,['https://ieseg.fr'],['ieseg.fr'],France,IÉSEG School of Management,None,FR
3,['https://sysu.edu.cn'],"['mail2.sysu.edu.cn', 'mail.sysu.edu.cn']",China,Sun Yat-Sen University,None,CN
4,['https://rhul.ac.uk'],['rhul.ac.uk'],United Kingdom,Royal Holloway University of London,None,GB

,web_pages,domains,country,name,state-province,alpha_two_code
count,9934,9934,9934,9934,9934,9934
unique,9930,9932,205,9850,249,204
top,['http://www.kanpuruniversity.org/'],['kanpuruniversity.org'],United States,Arab Open University,None,US
freq,2,2,2267,6,8824,2267

No columns have missing data.

In [8]:
# select * from df_3 where upper(substring(name,2,2)) = 'ER'  
# substring to be searched
sub ='er'

# start var
start = 2

# creating and passing series to new column
df_2["Indexes"] = df_2["name"].str.find(sub, start)
 
# display
df_2.head()

,country,name,state-province,domains,alpha_two_code,web_pages,Indexes
0,Ukraine,Kharkiv National University,None,"['student.karazin.ua', 'karazin.ua']",UA,['https://karazin.ua'],21
1,Chile,Universidad Técnica Federico Santa María,None,['usm.cl'],CL,['https://usm.cl'],4
2,France,IÉSEG School of Management,None,['ieseg.fr'],FR,['https://ieseg.fr'],-1
3,China,Sun Yat-Sen University,None,"['mail2.sysu.edu.cn', 'mail.sysu.edu.cn']",CN,['https://sysu.edu.cn'],16
4,United Kingdom,Royal Holloway University of London,None,['rhul.ac.uk'],GB,['https://rhul.ac.uk'],19

In [9]:
# select * from df_2 where upper(substring(name,2,2)) = 'ER'

result = df_2[df_2['name'].str[1:3].str.upper() == 'ER']
result.head()

,country,name,state-province,domains,alpha_two_code,web_pages,Indexes
204,United States,Berea College,None,['berea.edu'],US,['http://www.berea.edu/'],-1
205,United States,Berklee College of Music,None,['berklee.edu'],US,['http://www.berklee.edu/'],-1
412,United States,Ferris State University,None,['ferris.edu'],US,['http://www.ferris.edu/'],17
609,United States,Mercer County Community College,None,['mccc.edu'],US,['http://www.mccc.edu/'],4
610,United States,Mercer University,None,['mercer.edu'],US,['http://www.mercer.edu/'],4

In [12]:
#  select * from df_3 where upper(name) like %COLLEGE% and country <> 'United States'

result = df_2[(df_2['name'].str.upper().str.contains('COLLEGE')) & (df_2['country'] != 'United States')]
result.head()

,country,name,state-province,domains,alpha_two_code,web_pages,Indexes
552,Canada,Lambton College,Ontario,"['lambtoncollege.ca', 'mylambton.ca']",CA,['https://www.lambtoncollege.ca'],-1
1436,Armenia,Mehrabyan Medical Institute and Medical College,None,['armmed.am'],AM,['http://www.armmed.am/'],-1
1452,Australia,Australian Lutheran College,South Australia,['alc.edu.au'],AU,['http://www.alc.edu.au/'],15
1453,Australia,Australian Maritime College,Tasmania,['amc.edu.au'],AU,['http://www.amc.edu.au/'],-1
1469,Australia,International College of Tourism and Hotel Man...,None,['icthm.edu.au'],AU,['http://www.icthm.edu.au/'],3

### 1.1 Working without duplicates

#### 1.1.1 selecting distinct observation from the record

In [48]:
#select distinct name, country, alpha_two_code from df_3
ds_df = df_2[['country','alpha_two_code','name']].drop_duplicates()
ds_df.head()
len(ds_df.name)

9916

In [47]:
# The fact that distinct name is chosen 
sqldf("select count(name) as vol from (select distinct name, country, alpha_two_code from df_2)")

    vol
0  9916

In [44]:
sqldf("select count(distinct name) as total from df_2")

   total
0   9850

In [9]:
sqldf("select * from df_3")

,state-province,country,name,web_pages,domains,alpha_two_code,Indexes
0,None,United States,Marywood University,['http://www.marywood.edu'],['marywood.edu'],US,13
1,Dehradun,India,University of Petroleum and Energy Studies,['https://www.upes.ac.in/'],['upes.ac.in'],IN,4
2,None,Canada,Cégep de Saint-Jérôme,"['https://www.cstj.qc.ca', 'https://ccmt.cstj....",['cstj.qc.ca'],CA,-1
3,None,United States,Lindenwood University,['http://www.lindenwood.edu/'],['lindenwood.edu'],US,15
4,Punjab,India,DAV Institute of Engineering & Technology,['http://www.davietjal.org/'],['davietjal.org'],IN,23
...,...,...,...,...,...,...,...
9777,None,Germany,Ostbayerische Technische Hochschule Amberg-Weiden,['https://www.oth-aw.de/'],['oth-aw.de'],DE,6
9778,None,Brazil,Centro Universitário UniFatecie,"['https://unifatecie.edu.br/', 'https://ead.un...",['fatecie.edu.br'],BR,11
9779,None,Finland,Häme University of Applied Sciences,['https://www.hamk.fi/'],['hamk.fi'],FI,9
9780,None,Turkey,Konya Technical University,['http://www.ktun.edu.tr/'],['ktun.edu.tr'],TR,20
9781,None,Viet Nam,VNU University of Engineering and Technology,['https://uet.vnu.edu.vn/'],['uet.vnu.edu.vn'],VN,8

In [ ]:
Name	Team	Number	Position	Age	Height	Weight	College	Salary

Out of the 9782 records in df_3, there are 10 duplicated records, which leafs us with 9772 records after we have removed the dupplicates.

#### 1.1.2 Counting distinct records

In [8]:
#select country, count(country) as total from df_dist order by total desc
df_3['country'].value_counts()

United States         2178
Japan                  566
India                  402
China                  395
Russian Federation     316
                      ...
Niger                    1
Lesotho                  1
Suriname                 1
Swaziland                1
Saint Lucia              1
Name: country, Length: 204, dtype: int64

In [14]:
sqldf("select country, count(*) as Total from df_3 group by country order by Total desc")

                country  Total
0         United States   2178
1                 Japan    566
2                 India    402
3                 China    395
4    Russian Federation    316
..                  ...    ...
199              Bhutan      1
200             Bermuda      1
201            Barbados      1
202             Bahamas      1
203             Andorra      1

[204 rows x 2 columns]

In [9]:
#select country, count (*) as total from (select distinct name, country, alpha_two_code from df_3) group by country order by total desc
out = df_3[['country','alpha_two_code','name']].drop_duplicates()
out['country'].value_counts()

United States         2168
Japan                  566
India                  402
China                  395
Russian Federation     316
                      ...
Niger                    1
Lesotho                  1
Suriname                 1
Swaziland                1
Saint Lucia              1
Name: country, Length: 204, dtype: int64

In [15]:
sqldf("select country, count(distinct name) as Total from df_3 group by country order by Total desc")

                country  Total
0         United States   2168
1                 Japan    566
2                 India    402
3                 China    395
4    Russian Federation    316
..                  ...    ...
199              Bhutan      1
200             Bermuda      1
201            Barbados      1
202             Bahamas      1
203             Andorra      1

[204 rows x 2 columns]

from the above it seems all of the duplicated records are from United States. Let us filter down on United States to have glimpse of the duplicated records.

Our expectation is that, the table is suppsoed to have a one record for each school. So, why are we having more than 1 records for some schools?

In [13]:
#To see all of the records of the duplicates
#select country, count(*) as total from (select distinct name, country, alpha_two_code from df_3) group by country having total > 1 
t1 = df_3[df_3['country']=='United States']
t1['name'].value_counts()[t1['name'].value_counts()>1]

Highland Community College        2
Southwestern Community College    2
Westminster College               2
Manchester Community College      2
Glendale Community College        2
Middlesex Community College       2
Blue Ridge Community College      2
College of DuPage                 2
Southeastern Community College    2
Three Rivers Community College    2
Name: name, dtype: int64

In [14]:
df_3[(df_3['country']=='United States') & ((df_3['name']=='Highland Community College') | (df_3['name']=='Southwestern Community College')) ]

,state-province,country,name,web_pages,domains,alpha_two_code,Indexes
9070,None,United States,Highland Community College,[http://www.highland.edu],[highland.edu],US,-1
9116,None,United States,Southwestern Community College,[http://www.swcciowa.edu],[swcciowa.edu],US,9
9129,None,United States,Highland Community College,[http://www.highlandcc.edu],[highlandcc.edu],US,-1
9438,None,United States,Southwestern Community College,[http://www.southwesterncc.edu],[southwesterncc.edu],US,9

In [16]:
sqldf("select * from df_3 where country = 'United States' and name in ('Highland Community College','Southwestern Community College')")

,state-province,country,name,web_pages,domains,alpha_two_code
0,None,United States,Highland Community College,['http://www.highland.edu'],['highland.edu'],US
1,None,United States,Southwestern Community College,['http://www.swcciowa.edu'],['swcciowa.edu'],US
2,None,United States,Highland Community College,['http://www.highlandcc.edu'],['highlandcc.edu'],US
3,None,United States,Southwestern Community College,['http://www.southwesterncc.edu'],['southwesterncc.edu'],US

We can see that Highland Community College and Southwestern Community College has got 2 records instead of 1 and that is because these schools has got more than 1 web_page i.e Highland Community College - ([http://www.highland.edu],[http://www.highlandcc.edu]) and Southwestern Community College - ([http://www.swcciowa.edu],[http://www.southwesterncc.edu]).

This has now provide reasons for the duplicates.

#### 1.1.3 Selecting Top 10 countries by number of Universities without duplicates

In [15]:
#select country, count(country) as counts from df_dist order by counts desc limit 10
t_0 = df_3[['country','alpha_two_code','name']].drop_duplicates()
t_0 = t_0['country'].value_counts().rename_axis('country').reset_index(name='counts')
t_0['percent'] = t_0['counts']/t_0['counts'].sum()
t_0['percent'] = t_0['percent'].map('{:.2%}'.format)
t_0.head(10)

              country  counts percent
0       United States    2168  22.19%
1               Japan     566   5.79%
2               India     402   4.11%
3               China     395   4.04%
4  Russian Federation     316   3.23%
5             Germany     305   3.12%
6              France     268   2.74%
7  Korea, Republic of     243   2.49%
8                Iran     193   1.98%
9           Indonesia     189   1.93%

In [ ]:
sqldf("select country,count")

#### 1.1.4 selecting a variable and calculating the mean

Using Python

In [48]:
#select Team, avg(Salary) as AvgSalary from df_2 where Salary != '' group by Team order by AvgSalary desc Limit 10;
t_f = df_2[['Team','Salary']].groupby('Team').mean().dropna().reset_index()
t_f.sort_values(by=['Salary'], inplace=True, ascending=False)
t_f.head(10)

                     Team     Salary
5     Cleveland Cavaliers 6733471.73
9   Golden State Warriors 6711293.08
12   Los Angeles Clippers 6707636.71
15             Miami Heat 6583812.10
4           Chicago Bulls 6105483.33
20  Oklahoma City Thunder 5822521.29
27        Toronto Raptors 5737712.90
26      San Antonio Spurs 5408293.91
19        New York Knicks 5270654.73
28              Utah Jazz 5225649.10

Using SQL

In [51]:
sqldf("select team,count(*)as vol,sum(salary) as total_sal, avg(Salary) as avg_sal from df_2 where Salary != '' group by Team order by avg_sal desc limit 10")

                    Team  vol   total_sal    avg_sal
0    Cleveland Cavaliers   11 74068189.00 6733471.73
1  Golden State Warriors   12 80535517.00 6711293.08
2   Los Angeles Clippers   14 93906914.00 6707636.71
3             Miami Heat   10 65838121.00 6583812.10
4          Chicago Bulls   12 73265800.00 6105483.33
5  Oklahoma City Thunder   14 81515298.00 5822521.29
6        Toronto Raptors   10 57377129.00 5737712.90
7      San Antonio Spurs   11 59491233.00 5408293.91
8        New York Knicks   11 57977202.00 5270654.73
9              Utah Jazz   10 52256491.00 5225649.10

In [52]:
#select Team, Name, max(Salary) as Salary from df_2 group by Team,Name order by Salary desc limit 10
tt = df_2[['Name','Team','Salary']].groupby(['Team','Name']).max().dropna().reset_index()
tt.sort_values(by=['Salary'], inplace=True, ascending=False)
tt.head(10)

                      Team               Name      Salary
231        New York Knicks    Carmelo Anthony 22875000.00
182             Miami Heat         Chris Bosh 22192730.00
147   Los Angeles Clippers         Chris Paul 21468695.00
247  Oklahoma City Thunder       Kevin Durant 20158622.00
52           Chicago Bulls       Derrick Rose 20093064.00
183             Miami Heat        Dwyane Wade 20000000.00
23           Brooklyn Nets        Brook Lopez 19689000.00
149   Los Angeles Clippers     DeAndre Jordan 19689000.00
327      San Antonio Spurs  LaMarcus Aldridge 19689000.00
65     Cleveland Cavaliers         Kevin Love 19689000.00

In [30]:
sqldf("select Team, Name, max(Salary) as Salary from df_2 group by Team,Name order by Salary desc limit 10")

                    Team               Name      Salary
0        New York Knicks    Carmelo Anthony 22875000.00
1             Miami Heat         Chris Bosh 22192730.00
2   Los Angeles Clippers         Chris Paul 21468695.00
3  Oklahoma City Thunder       Kevin Durant 20158622.00
4          Chicago Bulls       Derrick Rose 20093064.00
5             Miami Heat        Dwyane Wade 20000000.00
6          Brooklyn Nets        Brook Lopez 19689000.00
7    Cleveland Cavaliers         Kevin Love 19689000.00
8   Los Angeles Clippers     DeAndre Jordan 19689000.00
9      San Antonio Spurs  LaMarcus Aldridge 19689000.00

From the report above, Tony Wroten of the New York Knicks is the highest paying Players with a salary of $22.875m.

In [74]:
#select max(Salary) from df_2 where age = 20
df_2[df_2.Team == 'New York Knicks']['Salary'].max()

22875000.0

In [53]:
sqldf("select max(salary) as Max_Sal from df_2")

      Max_Sal
0 22875000.00

In [ ]:
#which team has the highest

#### 1.3.1 Inner Join using a Key

In [12]:
df_inner = pd.merge(left=df, right=df_1, left_on='ClientID', right_on='ClientID')

In [13]:
df_inner.head()

,ClientID,LoanDate,LoanAmount,Term,LoanSeries,LoanPeriodID,RepaymentTerm,InterestAmount,Age,year_with_the_bank,default_1,default_2,default,predicted_scores,Defaulted_0,Defaulted_1
0,69996,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,36,4,1,1,1,691.075522,0.691076,0.308924
1,69996,2/20/2018,70000.0,24.0,2.0,W,24.0,12600.0,36,4,1,1,1,691.075522,0.691076,0.308924
2,69998,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,51,4,1,1,1,0.969998,0.000970,0.999030
3,69999,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,40,4,1,1,1,945.334391,0.945334,0.054666
4,70000,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,56,4,1,1,1,242.479325,0.242479,0.757521

In [14]:
list(df_inner)

['ClientID',
 'LoanDate',
 'LoanAmount',
 'Term',
 'LoanSeries',
 'LoanPeriodID',
 'RepaymentTerm',
 'InterestAmount',
 'Age',
 'year_with_the_bank',
 'default_1',
 'default_2',
 'default',
 'predicted_scores',
 'Defaulted_0',
 'Defaulted_1']

#### *** Selecting only the required columns

In [15]:
df_inner_1 = df_inner[['ClientID','LoanDate','LoanAmount','Term','LoanSeries','LoanPeriodID','RepaymentTerm','InterestAmount',
 'Age','year_with_the_bank','default','predicted_scores','Defaulted_0','Defaulted_1']]

In [16]:
df_inner_1.head()

,ClientID,LoanDate,LoanAmount,Term,LoanSeries,LoanPeriodID,RepaymentTerm,InterestAmount,Age,year_with_the_bank,default,predicted_scores,Defaulted_0,Defaulted_1
0,69996,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,36,4,1,691.075522,0.691076,0.308924
1,69996,2/20/2018,70000.0,24.0,2.0,W,24.0,12600.0,36,4,1,691.075522,0.691076,0.308924
2,69998,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,51,4,1,0.969998,0.000970,0.999030
3,69999,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,40,4,1,945.334391,0.945334,0.054666
4,70000,8/8/2017,50000.0,24.0,1.0,W,24.0,9000.0,56,4,1,242.479325,0.242479,0.757521

In [17]:
df_inner_1.to_csv('C:\\Users\\seune\\desktop\\base_scoring_1.csv',index=False)

#### *** Selecting with multiple conditions.

In [18]:
#df_sql = np.where((df['LoanDate']>='8/8/2017') & (df['LoanAmount'] > 50000) & (df['FT_Team'].str.startswith('S')))

#Select * from df where LoanDate >= '8/8/2017' and LoanAmount > 50000 and Age > 30
df_sql = np.where((df['LoanDate'] >= '8/8/2017') & (df['LoanAmount'] > 50000) & (df['Age'] > 50))

In [19]:
df_sql_1 = df.loc[df_sql]
df_sql_1.head()

,ClientID,LoanDate,LoanAmount,Term,LoanSeries,LoanPeriodID,RepaymentTerm,InterestAmount,Age,year_with_the_bank,default_1,default_2
74,70040,9/10/2018,90000.0,24.0,3.0,W,24.0,16200.0,51,4,1,1
76,70040,9/16/2019,120000.0,24.0,5.0,W,24.0,21600.0,51,4,1,1
226,70095,8/9/2019,100000.0,24.0,5.0,W,24.0,18000.0,57,4,0,1
237,70097,9/21/2018,90000.0,24.0,3.0,W,24.0,16200.0,59,4,1,1
239,70097,9/20/2019,130000.0,24.0,5.0,W,24.0,23400.0,59,4,0,1

In [20]:
df_sql_1.shape

(370, 12)

In [25]:
# sorting dataframe
df_3.sort_values("Team", inplace = True)

df_3.dropna(inplace = True)
  
# making boolean series for a team name
filter1 = df_3["Team"]=="Atlanta Hawks"
  
# making boolean series for age
filter2 = df_3["Age"]>=27
  
# filtering data on basis of both filters
df_3.where(filter1 & filter2, inplace = True)

#.dropna(inplace = True)
  
# display
df_3

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Indexes
319,Mike Scott,Atlanta Hawks,32.0,PF,27.0,6-8,237.0,Virginia,3333333.0,-1.0
323,Jeff Teague,Atlanta Hawks,0.0,PG,27.0,6-2,186.0,Wake Forest,8000000.0,-1.0
311,Kirk Hinrich,Atlanta Hawks,12.0,SG,35.0,6-4,190.0,Kansas,2854940.0,-1.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0,-1.0
313,Kris Humphries,Atlanta Hawks,43.0,PF,31.0,6-9,235.0,Minnesota,1000000.0,-1.0
314,Kyle Korver,Atlanta Hawks,26.0,SG,35.0,6-7,212.0,Creighton,5746479.0,9.0
315,Paul Millsap,Atlanta Hawks,4.0,PF,31.0,6-8,246.0,Louisiana Tech,18671659.0,-1.0

In [17]:
#select * from df_3 where Team = 'Atlanta Hawks'

# sorting dataframe
df_3.sort_values("Team", inplace = True)
  
# making boolean series for a team name
filter = df_3["Team"]=="Atlanta Hawks"
  
# filtering data
df_3.where(filter, inplace = True)
  
# display
df_3

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Indexes
310,Tim Hardaway Jr.,Atlanta Hawks,10.0,SG,24.0,6-6,205.0,Michigan,1304520.0,-1.0
319,Mike Scott,Atlanta Hawks,32.0,PF,27.0,6-8,237.0,Virginia,3333333.0,-1.0
323,Jeff Teague,Atlanta Hawks,0.0,PG,27.0,6-2,186.0,Wake Forest,8000000.0,-1.0
316,Mike Muscala,Atlanta Hawks,31.0,PF,24.0,6-11,240.0,Bucknell,947276.0,-1.0
309,Kent Bazemore,Atlanta Hawks,24.0,SF,26.0,6-5,201.0,Old Dominion,2000000.0,-1.0
...,...,...,...,...,...,...,...,...,...,...
380,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
381,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
382,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
368,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
369,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### *** Selecting only records with Wildcard

In [ ]:
df_distinct.head()

#### *** Where a strings starts with U

In [ ]:
#select all record from the dataframe where name like University
df_json_sql = np.where((df_distinct['alpha_two_code'] == 'US') & (df_distinct['name'].str.startswith('U')))

In [ ]:
df_json_sql_1 = df_distinct.loc[df_json_sql]
df_json_sql_1.head()

In [ ]:
df_json_sql_1.shape

In [55]:
#select all record from the dataframe where name ends with 'Uni'
df_json1 = np.where((df_distinct['alpha_two_code'] == 'US') & (df_distinct['name'].str.endswith('Uni')))
df_json_1 = df_distinct.loc[df_json1]

NameError: name 'df_distinct' is not defined

#### *** Where a string contains 'Uni' and 'Was'

In [ ]:
#select all record from the dataframe where name like Uni and name like Was
df_json_s = np.where((df_json['name'].str.contains('Uni')) & (df_json['name'].str.contains('Was')))

In [ ]:
df_json_s_1 = df_json.loc[df_json_s]
df_json_s_1.head()

In [ ]:
df_json_s_a = df_json[df_json['name'].str.contains('Uni') & df_json['name'].str.contains('Was')]
df_json_s_a.head()

#### *** Select Country, alpha_two_code and count distinct Universities in each of the countries

In [80]:
#df_json.loc['country','alpha_two_code']

df_3[['country','alpha_two_code']].agg(['nunique','count','size'])


#.agg(['nunique','count','size'])

         country  alpha_two_code
nunique      204             204
count       9782            9782
size        9782            9782

In [79]:
df_3.groupby(['country','alpha_two_code']).agg(['count', 'nunique']).stack()

                                    state-province  name
country     alpha_two_code
Afghanistan AF             count                 0    40
                           nunique               0    40
Albania     AL             count                 0    16
                           nunique               0    16
Algeria     DZ             count                 0    29
...                                            ...   ...
Yemen       YE             nunique               0    13
Zambia      ZM             count                 0     7
                           nunique               0     7
Zimbabwe    ZW             count                 0    15
                           nunique               0    15

[408 rows x 2 columns]

### ****Case when

In [4]:
def myfunc(Start_Date,End_Date):
    Full_Year_Goal = None
    if (Start_Date >= '2014-07-27' or Start_Date == '2014-07-27') and End_Date <= '2015-07-25':
        Full_Year_Goal = 'Y'
    elif (Start_Date == '2015-07-26' or Start_Date == '2015-07-27') and End_Date == '2016-07-30':
        Full_Year_Goal = 'Y'
    elif (Start_Date == '2016-07-31' and End_Date == '2017-07-29'):
        Full_Year_Goal = 'Y'
    elif (Start_Date == '2017-07-30' or Start_Date == '2017-07-31') and End_Date == '2018-07-28':
        Full_Year_Goal = 'Y'
    else:
        Full_Year_Goal = 'N'
    return Full_Year_Goal

In [5]:
myfunc(Start_Date = '2014-07-27',End_Date = '2015-07-22')

'Y'